package sample;
/* Задание:
1. запустить убедится, что работает.
2. внести хоть какие-то изменения, которые меняют результат. и заставить это работать.
* */

public class Sample1 {
    public static void main (String[] arg){
        System.out.println("Чёрствый чебурек");
    }
}
