package by.itAcademy.homeworks.reflection;

/** Задание 71
 * 1) Создать класс с методом printHelloWorld().
 * 2) Вызвать метод с помощью рефлексии из основной программы.
 */

public class Hello {
    private void printHelloWorld(){
        System.out.println("Hello World!");
    }
}
