package by.itAcademy.homeworks.basics;

/*
    Задание 2
    На примере задания 1 изменить сообщение на "Hello Belarus!", откомпилировать его и запустить.
 */

public class Task1 {
    public static void main(String[] args) {
        System.out.println("Hello Belarus!");
    }
}
