package by.itAcademy.homeworks.basics;

/*
    Задание 1
    Набрать приведенный пример HelloWorld, откомпилировать его и запустить.
 */

public class Task1 {
    public static void main(String[] args) {
        System.out.println("Hello World");
    }
}
