package by.itAcademy.homeworks.basics;

/*
    Задание 3
    На примере задания 2 добавить к основному сообщению дополнительное “I like Java!”, откомпилировать его и запустить.
 */

public class Task3 {
    public static void main(String[] args) {
        System.out.println("Hello Belarus!\nI like Java!");
    }
}
