package by.itAcademy.homeworks.types;

//Написать метод, который принимает на вход два целых числа, делает их суммирование и складывает результат с произведением двух
//этих чисел, и возвращает полученный результат из метода. Передать на вход в метод любые два числа.
// Вывести полученный результат работы метода на экран

public class Task4 {
    public static void main(String[] args) {
        int a = 17;
        int b = 58;
        int z = (a + b) + a * b;
        System.out.println(z);
    }
}
