package by.itAcademy.homeworks.lamda;

// Создайте класс Person с полями name, surname, age. Сгенерируйте группу из 100 человек в возрасте от 15 до 30.
// Напишите ОДНУ НЕПРЕРЫВНУЮ цепочку stream вызовов, которая:
//
//выбирает объекты, возраст которых меньше 21;
//распечатывает их на экран;
//сортирует по фамилии, а потом по имени (использовать thenComparing у объекта Comparator);
//берет 4 первых объекта;
//формирует коллекцию из фамилий объектов;
//агрегирует все в коллекцию.

public class Task62 {
}
