package by.itAcademy.homeworks.basics;

/** Задание 3
 * В набранном из задания 2 примере добавить к основному сообщению дополнительное “I like Java!”.
 * Откомпилировать пример и запустить.
 */

public class Task3 {
  public static void main(String[] args) {
        System.out.print("Hello Belarus!");
        System.out.println("I Like Java!");
    }
}
